Revit 2026 API

# ViewGetWorksetVisibility Method

---

Returns the visibility settings of a workset for this particular view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WorksetVisibility GetWorksetVisibility(
	WorksetId worksetId
)
```
```vb
Public Function GetWorksetVisibility (
	worksetId As WorksetId
) As WorksetVisibility
```
```cpp
public:
WorksetVisibility GetWorksetVisibility(
	WorksetId^ worksetId
)
```
```fsharp
member GetWorksetVisibility :
        worksetId : WorksetId -> WorksetVisibility
```

#### Parameters

worksetId WorksetId
     Id of the workset.

#### Return Value

WorksetVisibility The visibility of a workset for this particular view.

| Exception | Condition |
| --- | --- |
| ArgumentException | There is no workset with this Id in the document associated with this view. |
| ArgumentNullException | A non-optional argument was null |

The settings does not reflect the fact of whether a workset is currently closed or not.

#### Reference

View Class

Autodesk.Revit.DB Namespace